# Calc
Interpreter in Fortran that can handle scalars and 1D arrays. The output of `xinterpret_gfort.exe` is
```
> n = 10
10.000000

> y = [1, 2, 3]
[1.000000, 2.000000, 3.000000]

> z = n * y
[10.000000, 20.000000, 30.000000]

> w = [10 20 30] + y
[11.000000, 22.000000, 33.000000]

> z ^ 2
[100.000000, 400.000000, 900.000000]

> x = runif(n)
[.319835, .881326, .629967, .373339, .227259, .569488, .348319, .644943, .929988, .247166]

> sum(x)
5.171631

> minval(x)
.227259

> maxval(x)
.929988

> q
```
